#=Написать функию, для заданного натурального числа n возвращающую массив всех биномиальных коэффициентов порядка n.
Указание. Воспользоваться "треугольником" Паскаля. (вопрос: почему формула $C_n^k=\frac{n!}{k!(n-k)!}$ при сколько-нибудь больших n не подходит для практических вычислений?).
Рассмотреть следующие варианты реализации вычисления биномиальных кэффициентов с использованием "треугольника" Паскаля:
а) с использованием двух массивов длины n (плюс-минус 1);
b) с использованием только одного массива длины n;
г) с использованием массива длины n/2 - это возможно с учетом свойства симметрии биномиальных коэффициентов (в этом случае должна возвращаться только первая половина набора всех биномиальных коэффициентов заданного порядка).=#

function binomial_coeffs_a(n::Integer)::Vector{Int}
    c=Int[]
    for _ in 1:n
        c=vcat(1, c[1:end-1] .+ c[2:end], 1)
    end
    return c
end

function binomial_coeffs_b(n::Integer)::Vector{Int}
    c=Int[]
    for k in 1:n
        if k==1
            append!(c,div((n-k+1),k))
        else
            append!(c,div((n-k+1)*c[k-1],k))
        end
    end
    pushfirst!(c,1)
    return c
end

function binomial_coeffs_g(n::Integer)::Vector{Int}
    c=Int[]
    for k in 1:div(n,2)
        if k==1
            append!(c,div((n-k+1),k))
        else
            append!(c,div((n-k+1)*c[k-1],k))
        end
    end
    pushfirst!(c,1)
    return c
end
